БухЭксп/InformationRegisters/CW_ЗначенияФинансовыхСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗначенияФинансовыхСтатусовОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФинансовыйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ФинансовыеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСтатуса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ОбъектыФинансовыхСтатусов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ФинансовыеСтатусы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ФинансовыеСтатусы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКартинки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_ФинансовыеСтатусыСервер/Ext/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Объект = Форма.Объект;
	
	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_ОбъектыФинансовыхСтатусов.Тип.Типы();
	Если мДоступныеТипы.Найти(ТипЗнч(Объект.Ссылка)) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанынеСтатуса = ПолучитьДанныеФинансовогоСтатуса(Объект.Ссылка);
	
	Форма.ФинансовыйСтатус  = ДанынеСтатуса.ФинансовыйСтатус;
	Форма.Элементы.ФинансовыйСтатус.СписокВыбора.Добавить(ДанынеСтатуса.ФинансовыйСтатус,,,ДанынеСтатуса.Оформление.Картинка);
	
КонецПроцедуры

Процедура ПриСозданииФормыСпискаНаСервере(Форма, ИмяТаблицыФормы, ИдентификаторОбъекта, Отказ, СтандартнаяОбработка) Экспорт
	
	СкрыватьКартинкиСтатусов = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "СкрыватьКартинкиФинансовыхСтатусовВЖурналах");
	Форма.Элементы.ФинансовыйСтатусКартинка.Видимость = НЕ СкрыватьКартинкиСтатусов;
	
	УстановитьУсловноеОфрмлениеСтатусов(Форма.УсловноеОформление, ИмяТаблицыФормы, ИдентификаторОбъекта);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	Объект = Форма.Объект;

	ДанынеСтатуса = ПолучитьДанныеФинансовогоСтатуса(Объект.Ссылка);
	
	Форма.ФинансовыйСтатус  = ДанынеСтатуса.ФинансовыйСтатус;
	Форма.Элементы.ФинансовыйСтатус.СписокВыбора.Добавить(ДанынеСтатуса.ФинансовыйСтатус,,,ДанынеСтатуса.Оформление.Картинка);
	
КонецПроцедуры

Процедура УстановитьУсловноеОфрмлениеСтатусов(УсловноеОформление, ИмяТаблицыФормы, ИдентификаторОбъекта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ФинансовыеСтатусы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_ФинансовыеСтатусы КАК CW_ФинансовыеСтатусы
	               |ГДЕ
	               |	CW_ФинансовыеСтатусы.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		Элемент.ИдентификаторПользовательскойНастройки = Строка("ФИНАНСОВЫЕ_СТАТУСЫ");
		
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ИмяТаблицыФормы);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(ИмяТаблицыФормы+".ФинансовыйСтатус");
		ОтборЭлемента.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение 	= Выборка.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ФинансовыеСтатусыДоступныДляОбъкта(ТипОбъекта) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.CW_ОбъектыФинансовыхСтатусов.Тип.СодержитТип(ТипОбъекта);
	
КонецФункции

Функция ОпределитьФинансовыйСтатусОбъекта(ИдентификаторОбъекта) Экспорт
	
	СоответствиеНеопредленногоСтатуса = Справочники.CW_ФинансовыеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	СтатусНеопределен = СоответствиеНеопредленногоСтатуса.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	СоответствиеМакетов = Справочники.CW_ФинансовыеСтатусы.ПолучитьСоответствиеИмениМакетаТипуЗначения();
	МакетОтбора 		= СоответствиеМакетов.Получить(ТипЗнч(ИдентификаторОбъекта));
	
	Если МакетОтбора = Неопределено Тогда
		Возврат СтатусНеопределен;
	КонецЕсли;

	КонтрольноеКоличествоСтрок 		= 1;
	ПрименятьУсловиеГрузоперевозок	= ТипЗнч(ИдентификаторОбъекта) = Тип("СправочникСсылка.CW_Заказы");
	
	Если ПрименятьУсловиеГрузоперевозок Тогда
	 	КонтрольноеКоличествоСтрок = ПолучитьКоличествоГрузоперевозокПоЗаказу(ИдентификаторОбъекта);
	КонецЕсли;
	
	ИндентификаторОбъекта = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(ИдентификаторОбъекта));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ФинансовыеСтатусы.Код КАК Код,
	               |	CW_ФинансовыеСтатусы.Ссылка КАК Ссылка,
	               |	CW_ФинансовыеСтатусы.ХранилищеОтбора КАК ХранилищеОтбора,
	               |	CW_ФинансовыеСтатусы.ВариантВыплненияУсловияДляПодчиненныхГрузоперевозок КАК ВариантУсловияГрузоперевозок,
	               |	CW_ФинансовыеСтатусы.Предопределенный КАК Предопределенный
	               |ИЗ
	               |	Справочник.CW_ФинансовыеСтатусы КАК CW_ФинансовыеСтатусы
	               |ГДЕ
	               |	CW_ФинансовыеСтатусы.ИдентификаторОбъекта = &ИндентификаторОбъекта
	               |	И CW_ФинансовыеСтатусы.ПометкаУдаления = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ИндентификаторОбъекта", ИндентификаторОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПрименятьУсловиеГрузоперевозок = ?(Выборка.Предопределенный, Ложь, ПрименятьУсловиеГрузоперевозок);
		
		ПараметрыСтатуса = Новый Структура;
		ПараметрыСтатуса.Вставить("ИдентификаторОбъекта",			ИдентификаторОбъекта);
		ПараметрыСтатуса.Вставить("ИмяМакета",						МакетОтбора);
		ПараметрыСтатуса.Вставить("ХранилищеОтбора", 				Выборка.ХранилищеОтбора);
		ПараметрыСтатуса.Вставить("КоличествоСтрок",				КонтрольноеКоличествоСтрок);
		
		ПараметрыСтатуса.Вставить("ВариантУсловияГрузоперевозок", 	Выборка.ВариантУсловияГрузоперевозок);
		
		ПараметрыСтатуса.Вставить("ПрименятьУсловия", 				ПрименятьУсловиеГрузоперевозок);
		
		Успешно = ПроверитьУсловияСтатуса(ПараметрыСтатуса);
		
		Если Успешно Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтатусНеопределен;
	
КонецФункции

Функция ПолучитьДанныеФинансовогоСтатуса(ОбъектСтатуса) Экспорт
	
	СоответствиеПервогоСтатуса 	= Справочники.CW_ФинансовыеСтатусы.ПолучитьСоответствиеНеопредленногоСтатуса();
	ПервыйСтатус 				= СоответствиеПервогоСтатуса.Получить(ТипЗнч(ОбъектСтатуса));
	
	Оформление 		= ПолучитьОформлениеСтатуса(ПервыйСтатус);
	ДанныеСтатуса	= Новый Структура("ФинансовыйСтатус,Оформление", ПервыйСтатус, Оформление);
	
	Если ОбъектСтатуса.Пустая() Тогда
		Возврат ДанныеСтатуса;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ЗначенияФинансовыхСтатусовОбъектов.ОбъектСтатуса КАК ОбъектСтатуса,
	               |	CW_ЗначенияФинансовыхСтатусовОбъектов.ФинансовыйСтатус КАК ФинансовыйСтатус
	               |ИЗ
	               |	РегистрСведений.CW_ЗначенияФинансовыхСтатусовОбъектов КАК CW_ЗначенияФинансовыхСтатусовОбъектов
	               |ГДЕ
	               |	CW_ЗначенияФинансовыхСтатусовОбъектов.ОбъектСтатуса = &ОбъектСтатуса";
	
	Запрос.УстановитьПараметр("ОбъектСтатуса", ОбъектСтатуса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		Оформление 		= ПолучитьОформлениеСтатуса(Выборка.ФинансовыйСтатус);
	   	ДанныеСтатуса	= Новый Структура("ФинансовыйСтатус,Оформление", Выборка.ФинансовыйСтатус, Оформление);

	КонецЕсли;
	
	Возврат ДанныеСтатуса;
	
КонецФункции

Функция ПолучитьОформлениеСтатуса(ФинансовыйСтатус) Экспорт
	
	ДанныеКартинки 	= ФинансовыйСтатус.ХранилищеКартинки.Получить();
	Картинка 		= Новый Картинка(ДанныеКартинки);

	Оформление 		= Новый Структура("Картинка", Картинка);
	
	Возврат Оформление;

КонецФункции

Функция ПроверитьУсловияСтатуса(ПараметрыСтатуса)
	
	НастройкиСтатуса 		= ПараметрыСтатуса.ХранилищеОтбора.Получить();
	
	СхемаКомпоновкиДанных 	= Справочники.CW_ФинансовыеСтатусы.ПолучитьМакет(ПараметрыСтатуса.ИмяМакета);
	Настройки 				= СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Если НастройкиСтатуса <> Неопределено Тогда
		_УФС.СкопироватьОтбор(НастройкиСтатуса.Отбор, Настройки.Отбор);
	КонецЕсли;
	
	ЭлементОтбора 					= Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ПараметрыСтатуса.ИдентификаторОбъекта;
	ЭлементОтбора.Использование	 	= Истина;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	Результат = Новый ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если Результат.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УсловиеГрузоперевозокВыполнено 	= Истина;
	
	СтрокаТаблицы = Результат[0]; 
	
	Если ПараметрыСтатуса.ПрименятьУсловия Тогда 
		Если ПараметрыСтатуса.ВариантУсловияГрузоперевозок = 2 Тогда
			УсловиеГрузоперевозокВыполнено = СтрокаТаблицы.Грузоперевозка > 0;
		ИначеЕсли ПараметрыСтатуса.ВариантУсловияГрузоперевозок = 1 Тогда
			УсловиеГрузоперевозокВыполнено = СтрокаТаблицы.Грузоперевозка = ПараметрыСтатуса.КоличествоСтрок;
		КонецЕсли;
	КонецЕсли;
	
	Возврат УсловиеГрузоперевозокВыполнено;
	

КонецФункции

Функция ПолучитьКоличествоГрузоперевозокПоЗаказу(Заказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ CW_Грузоперевозки.Ссылка) КАК Количество
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |ГДЕ
	               |	CW_Грузоперевозки.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
		РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	
	//Если грузоперевозок нет, то возвращаем 1, так как в исходном запрсоа по статусам в этом случае будет одна строка
	Возврат 1;
	
КонецФункции

Функция ЗаписатьФинансовыйСтатусОбъекта(ИдентификаторОбъекта) Экспорт
	
	ФинансовыйСтатус = ОпределитьФинансовыйСтатусОбъекта(ИдентификаторОбъекта);
	
	//Запишем данные в регистр
	РегистрыСведений.CW_ЗначенияФинансовыхСтатусовОбъектов.ЗаписатьФинансовыйСтатусОбъекта(ИдентификаторОбъекта, ФинансовыйСтатус);
	
КонецФункции

Процедура ЗаписатьФинансовыйСтатусОбъектов(СтруктураПараметров, АдресРезультат = Неопределено) Экспорт
	
	Для Каждого СсылкаВМассиве из СтруктураПараметров.МассивСсылок Цикл
		ЗаписатьФинансовыйСтатусОбъекта(СсылкаВМассиве);
	КонецЦикла;
	
КонецПроцедуры

//УСТАРЕЛА
Процедура РасчитатьФинансовыйСтатус(ИсходныйМассив, РасчитыватьСтатусСвзанныхОбъектов = Истина) Экспорт
	
	РассчитатьФинансовыйСтатус(ИсходныйМассив, РасчитыватьСтатусСвзанныхОбъектов);
	
КонецПроцедуры


Процедура РассчитатьФинансовыйСтатус(ИсходныйМассив, РасчитыватьСтатусСвзанныхОбъектов = Истина) Экспорт
	
	МассивДляРасчета = ПолучитьМассивДоступныхОбъектовДляРасчета(ИсходныйМассив);
	Если МассивДляРасчета.Количество() > 0 Тогда
		ПараметрыПроцедуры = Новый Структура;
		ПараметрыПроцедуры.Вставить("МассивСсылок", МассивДляРасчета);
		
		CW_ФинансовыеСтатусыСервер.ЗаписатьФинансовыйСтатусОбъектов(ПараметрыПроцедуры);
	КонецЕсли;
	
	Если РасчитыватьСтатусСвзанныхОбъектов Тогда
		РассчитатьФинансовыйСтатусСвязанныхОбъектовВФоне(ИсходныйМассив);	
	КонецЕсли;
	
КонецПроцедуры

Процедура РассчитатьФинансовыйСтатусСвязанныхОбъектовВФоне(ИсходныйМассив)
	
	ДоступныеТипыПоОпциям 	= ПолучитьДоступныеТипыПоОпциям();

	МассивСсылок = КритерииОтбора.CW_ОбъектыРасчетаСтатусов.ПолучитьМассивСсылокДляРасчетаСтатусов(ИсходныйМассив, ДоступныеТипыПоОпциям);
	Если МассивСсылок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МассивСсылок", МассивСсылок);
	
	мПараметрыПроцедуры = Новый Массив;
	мПараметрыПроцедуры.Добавить(ПараметрыПроцедуры);
	
	ФоновыеЗадания.Выполнить("CW_ФинансовыеСтатусыСервер.ЗаписатьФинансовыйСтатусОбъектов", мПараметрыПроцедуры, , "Расчет финансовых статусов");

КонецПроцедуры

Функция ПолучитьМассивДоступныхОбъектовДляРасчета(Знач МассивСсылок)
	
	Результат = Новый Массив;

	ДоступныеТипыПоОпциям = ПолучитьДоступныеТипыПоОпциям();
	
	Для Каждого СсылкаВМассиве из МассивСсылок Цикл
		Если CW_ФинансовыеСтатусыСервер.ФинансовыеСтатусыДоступныДляОбъкта(ТипЗнч(СсылкаВМассиве)) 
			И ДоступныеТипыПоОпциям.Найти(ТипЗнч(СсылкаВМассиве)) <> Неопределено Тогда
			Результат.Добавить(СсылкаВМассиве);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоступныеТипыПоОпциям() Экспорт
	
	Результат = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Грузоперевозки"));
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыЗаказов") Тогда
		Результат.Добавить(Тип("СправочникСсылка.CW_Заказы"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
